constant/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 -0.6 -0.5)
    ( 0.5 -0.6 -0.5)
    ( 0.5  0.5 -0.5)
    (-0.5  0.5 -0.5)
    (-0.5 -0.6  0.5)
    ( 0.5 -0.6  0.5)
    ( 0.5  0.5  0.5)
    (-0.5  0.5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 20 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 5 4 0)  // Entrada
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)  // Saida
        );
    }
);


// ************************************************************************* //
