constant/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "cylinder.stl"
    "outerCylinder.stl"
    "helice.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    // Remove features with fewer than the specified number of edges
    minElem         10;
}

// ************************************************************************* //
